# Обычное деление
print(f'9 / 5 = {9 / 5}')

# Целочисленное деление
print(f'9 // 5 = {9 // 5}')

"""
    Остаток от деления - %
    Делимое % Делитель = Остаток
    
    1. Остаток всегда целое число
    2. Остаток всегда меньше делителя
    3. Если делимое меньше делителя, то результат равен делимому
    
    n % 10 - получение последней цифры числа
"""

# TODO: Дано трёхзначное число
#       Необходимо найти сумму его цифр
num = int(input())
# print(f'Сумма цифр числа {num} = {num // 10 + num % 10}')
print(f'Сумма цифр числа {num} = {... + ... + ...}')
